hso-esk/emb6/target/arch/arm/cm3/ti/device/cc13xx/sf_rf_6lowpan.c
static e_rf_status_t sf_rf_get_Status(void)
{
  return cc1310.state;
}

static uint8_t* sf_rf_get_p_lastPkt(void)
{
  return cc1310.rx.p_lastPkt;
}

static uint16_t sf_rf_get_LenLastPkt(void)
{
  return cc1310.rx.LenLastPkt;
}

static uint8_t sf_rf_getRssi(void)
{
  return cc1310.rx.c_rssiValue;
}

static uint8_t sf_rf_init_tx(uint8_t *pc_data, uint16_t  i_len)
{
  if (pc_data!=NULL && i_len > 1)
  {
    cc1310.tx.p_cmdPropTxAdv->pktLen = i_len ;
    cc1310.tx.p_cmdPropTxAdv->pPkt = pc_data;
    cc1310.tx.p_cmdPropTxAdv->pPkt[0] = i_len - 1 + 2 ;
    return 1;
  }
  return 0;
}


static bool sf_rf_set_numOfRssiMeas(uint8_t num)
{
  if( num )
    cc1310.cca.c_numOfRssiMeas=num;
  else
    return false;
  return true;
}

static void sf_rf_init_cca_cmd(void)
{
  /* Fill the carrier sense command */
  /* The command ID number 0x3805 */
  cc1310.cca.s_cmdCS.commandNo = CMD_PROP_CS;
  /* An integer telling the status of the command.
   * This value is updated by the radio CPU during operation and may be read by the system
   * CPU at any time. */
  cc1310.cca.s_cmdCS.status = 0U;
  /* Pointer to the next operation to run after this operation is done */
  cc1310.cca.s_cmdCS.pNextOp = NULL;
  /* Absolute or relative start time (depending on the value of startTrigger) */
  cc1310.cca.s_cmdCS.startTime = 0U;
  /* The type of trigger. */
  cc1310.cca.s_cmdCS.startTrigger.triggerType = TRIG_NOW;
  /* 0: No alternative trigger command */
  cc1310.cca.s_cmdCS.startTrigger.bEnaCmd = 0U;
  /* The trigger number of the CMD_TRIGGER command that triggers this action */
  cc1310.cca.s_cmdCS.startTrigger.triggerNo = 0U;
  /* 0: A trigger in the past is never triggered, or for start of commands, give an error */
  cc1310.cca.s_cmdCS.startTrigger.pastTrig = 0U;
  /* Condition for running next command: Rule for how to proceed */
  cc1310.cca.s_cmdCS.condition.rule = 1U;
  /* Number of skips if the rule involves skipping */
  cc1310.cca.s_cmdCS.condition.nSkip = 0U;
  /* 0: Keep synth running if command ends with channel Idle */
  cc1310.cca.s_cmdCS.csFsConf.bFsOffIdle = 0U;
  /* 0: Keep synth running if command ends with channel Busy */
  cc1310.cca.s_cmdCS.csFsConf.bFsOffBusy = 0U;
  /* If 1, enable RSSI as a criterion. */
  cc1310.cca.s_cmdCS.csConf.bEnaRssi = 1U;
  /* If 0, disable correlation as a criterion. */
  cc1310.cca.s_cmdCS.csConf.bEnaCorr = 0U;
  /* 0: Busy if either RSSI or correlation indicates Busy */
  cc1310.cca.s_cmdCS.csConf.operation = 0U;
  /* 1: End carrier sense on channel Busy */
  cc1310.cca.s_cmdCS.csConf.busyOp = 1U;
  /* 1: End on channel Idle */
  cc1310.cca.s_cmdCS.csConf.idleOp = 1U;
  /* 0: Timeout with channel state Invalid treated as Busy */
  cc1310.cca.s_cmdCS.csConf.timeoutRes = 0U;
  /* Set the RSSI threshold value for a busy channel */
  cc1310.cca.s_cmdCS.rssiThr = RF_CCA_RSSI_THR;
  /* Number of consecutive RSSI measurements below the threshold needed before
   * the channel is declared Idle.  */
  cc1310.cca.s_cmdCS.numRssiIdle = cc1310.cca.c_numOfRssiMeas;
  /* Number of consecutive RSSI measurements above the threshold needed before
   * the channel is declared Busy */
  cc1310.cca.s_cmdCS.numRssiBusy = cc1310.cca.c_numOfRssiMeas;
  /* The type of trigger */
  cc1310.cca.s_cmdCS.csEndTrigger.triggerType = TRIG_NEVER;
  /* 0: No alternative trigger command */
  cc1310.cca.s_cmdCS.csEndTrigger.bEnaCmd = 0U;
  /* The trigger number of the CMD_TRIGGER command that triggers this action */
  cc1310.cca.s_cmdCS.csEndTrigger.triggerNo = 0U;
  /* 0: A trigger in the past is never triggered, or for start of commands, give an error */
  cc1310.cca.s_cmdCS.csEndTrigger.pastTrig = 0U;
  /*  Time used together with csEndTrigger for ending the operation. */
  cc1310.cca.s_cmdCS.csEndTime = 0U;
}



static bool sf_rf_update_run_frequency(uint16_t frequency, uint16_t fractFreq)
{
    /* check the struct is already initialized */
    if(cc1310.conf.ps_cmdFs== NULL)
        return false;
#if USE_TI_RTOS

    /* Cancel the previous command  */
    RF_cancelCmd(gps_rfHandle, gps_rf_cmdHandle, 1);
    /* check if the center frequency is changed then we have to setup the radio again */
    if(((rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup)->centerFreq != frequency)
    {
        /* set the new center Frequency */
        ((rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup)->centerFreq=frequency;
        /* send Setup command again */
     /*   result = RF_runCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdPropRadioDivSetup, RF_PriorityNormal, NULL, 0);
        if (!(result & RF_EventLastCmdDone))
        {
          return false;
        }
        */
        gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdPropRadioDivSetup, RF_PriorityNormal, NULL, 0);
        if(gps_rf_cmdHandle < 0 )
         {
            return false ;
         }
    }
    /* update FS command */
    ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->frequency=frequency;
    ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->fractFreq=fractFreq;

    /* Send CMD_FS command to RF Core */
  /*  result = RF_runCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdFs, RF_PriorityNormal, NULL, 0);
    if (!(result & RF_EventLastCmdDone))
    {
      return false;
    }
*/
    gps_rf_cmdHandle = RF_postCmd(gps_rfHandle, (RF_Op*)cc1310.conf.ps_cmdFs , RF_PriorityNormal, NULL, 0);
    if(gps_rf_cmdHandle < 0 )
     {
        return false ;
     }
#else
    /* Stop the last command : it should be RX command (May be no command in sleepy mode) */
    RFC_sendDirectCmd(CMDR_DIR_CMD(CMD_ABORT));
    /* check if the center frequency is changed then we have to setup the radio again */
    if(((rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup)->centerFreq != frequency)
    {
        /* set the new center Frequency */
        ((rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup)->centerFreq=frequency;
        /* send Setup command again */
        if(RFC_setupRadio(cc1310.conf.ps_cmdPropRadioDivSetup) != RFC_OK)
            return false ;
    }
    /* update FS command */
    ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->frequency=frequency;
    ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->fractFreq=fractFreq;
    /* Send CMD_FS command to RF Core */
    if(RFC_sendRadioOp(cc1310.conf.ps_cmdFs) != RFC_CMDSTATUS_DONE)
    {
      bsp_led( HAL_LED3, EN_BSP_LED_OP_ON );
      return false ;
    }
#endif
    return true;
}


static bool sf_rf_update_frequency(uint16_t frequency, uint16_t fractFreq)
{
   /* check the struct is already initialized */
  if(cc1310.conf.ps_cmdFs == NULL || cc1310.conf.ps_cmdPropRadioDivSetup == NULL)
    return false;
  /* update center Frequency */
  ((rfc_CMD_PROP_RADIO_DIV_SETUP_t*)cc1310.conf.ps_cmdPropRadioDivSetup)->centerFreq=frequency;
  /* update FS command */
  ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->frequency=frequency;
  ((rfc_CMD_FS_t*)cc1310.conf.ps_cmdFs)->fractFreq=fractFreq;
  return true;
}

/*==============================================================================
                         LOCAL FUNCTIONS
==============================================================================*/

/*******************************************************************************
 * @brief   Switch to use HF XTAL
 *
 * @param   None
 *
 * @return  None
 *******************************************************************************/
#if !USE_TI_RTOS
static void loc_switchToHfXtalOsc(void)
{
  /* Enable OSC DIG interface to change clock sources */
  OSCInterfaceEnable();

  /* Check to not enable XOSC if already enabled */
  if(OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF)
  {
    /* Disable autostart of XOSC state machine */
    DDI32BitsSet(AUX_DDI0_OSC_BASE,
        DDI_0_OSC_O_AMPCOMPCTL,
        DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL);

    /* Request to switch to the crystal to enable radio operation. */
    OSCClockSourceSet(OSC_SRC_CLK_MF | OSC_SRC_CLK_HF, OSC_XOSC_HF);

    /* Wait for a while */
    CPUdelay(48000000/3*0.002);

    /* Enable autostart, will start the state machine */
    DDI32BitsClear(AUX_DDI0_OSC_BASE,
        DDI_0_OSC_O_AMPCOMPCTL,
        DDI_0_OSC_AMPCOMPCTL_AMPCOMP_SW_CTRL);

    /* Switch the HF source - Done via ROM API*/
    OSCHfSourceSwitch();
  }

  /* Disable OSC DIG interface */
  OSCInterfaceDisable();
}
#endif

#ifdef __cplusplus
}
#endif
